src/DataProcessors/внЖурналРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>внЖурналРегистрации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УзелРИБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетаданныеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компьютер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерсияИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобытиеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеЗаписи</Name>
							<Comment>// 0 - в кэше, 1 - во внешней БД не сжато, 2 - во внешней БД сжато изменений нет, 3 - во внешней БД сжато изменения есть</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/внЖурналРегистрации/Ext/ManagerModule.bsl
Функция Печать(Структура) Экспорт
	
	Макет = Обработки.внЖурналРегистрации.ПолучитьМакет("Макет");	
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Шапка
	Область  						= Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Код 			= Формат(Структура.Код, "ЧРД=; ЧРГ=; ЧН=0; ЧГ=");
	Область.Параметры.ДатаИзменения = Структура.ДатаИзменения;
	Область.Параметры.Пользователь 	= Структура.Пользователь;
	Область.Параметры.Компьютер 	= Структура.Компьютер;
	Область.Параметры.УзелРИБ 		= Структура.УзелРИБ;
	Область.Параметры.ПредставлениеОбъекта = ?(ПустаяСтрока(Структура.ПредставлениеОбъекта), "<Объект недоступен для открытия>", Структура.ПредставлениеОбъекта);
	Область.Параметры.СтатусСжатия 	= Структура.СтатусСжатия;
	Область.Параметры.СобытиеПредставление 	= Структура.СобытиеПредставление;
	Область.Параметры.ВыводимыеДанные = ?(Структура.ТолькоИзменения, "Показаны только изменения объекта", "Показан полный список значений реквизитов");
	Если ТипЗнч(Структура.ОбъектСсылка) <> Тип("Строка") Тогда
		Область.Параметры.ОбъектСсылка = Структура.ОбъектСсылка;
	КонецЕсли;
	ТабДокумент.Вывести(Область);
	
	Область  						= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(Область);
	
	// Вывод данных
	ТабДокумент.НачатьАвтогруппировкуСтрок();
	ВывестиДеревоЗначений(Макет, ТабДокумент, Структура.ДеревоИзменений, 0);	
	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();	
	
	Область  						= Макет.ПолучитьОбласть("Легенда");
	ТабДокумент.Вывести(Область);
	
	ТабДокумент.ОтображатьСетку	 	= Ложь;
	ТабДокумент.Защита 				= Истина;
	ТабДокумент.ТолькоПросмотр 		= Истина;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ВывестиДеревоЗначений(Знач Макет, ТабДокумент, СтрокаДереваЗначений, Уровень)
	
	Для Каждого Строки Из СтрокаДереваЗначений.Строки Цикл 

		ОбластьСтрока  = Макет.ПолучитьОбласть("Уровень" + Строка(Уровень));
		ОбластьСтрока.Параметры.Заполнить(Строки);
		Попытка
			ОбластьСтрока.Параметры.СтароеЗначение = Неопределено;
			Значение = ЗначениеИзСтрокиВнутр(Строки.СтароеЗначение);			
			ТипЗначения = ТипЗнч(Строки.СтароеЗначение);
			Если ТипЗначения <> Тип("Число") И ТипЗначения <> Тип("Строка") И ТипЗначения <> Тип("Булево") И ТипЗначения <> Тип("Дата") Тогда
				ОбластьСтрока.Параметры.СтароеЗначение = Значение;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка		
			ОбластьСтрока.Параметры.НовоеЗначение = Неопределено;
			Значение = ЗначениеИзСтрокиВнутр(Строки.НовоеЗначение);
			ТипЗначения = ТипЗнч(Значение);
			Если ТипЗначения <> Тип("Число") И ТипЗначения <> Тип("Строка") И ТипЗначения <> Тип("Булево") И ТипЗначения <> Тип("Дата") Тогда
				ОбластьСтрока.Параметры.НовоеЗначение = Значение;
			КонецЕсли;
		Исключение
		КонецПопытки;
				
		ОбластьОформления = ТабДокумент.Вывести(ОбластьСтрока, Уровень);
		    
		Если Строки.СтароеЗначение <> Строки.НовоеЗначение Тогда
			
			ЦветФона = WebЦвета.АнтикБелый;
			Если Строки.НовоеЗначение = "" Тогда
				ЦветФона = WebЦвета.БледноБирюзовый;
			ИначеЕсли Строки.СтароеЗначение = "" Тогда
				ЦветФона = WebЦвета.СветлоЗеленый;
			КонецЕсли;
			ТабДокумент.Область(ОбластьОформления.Верх, 2, ОбластьОформления.Низ, 4).ЦветФона = ЦветФона;
			
		КонецЕсли;
		
		ВывестиДеревоЗначений(Макет, ТабДокумент, Строки, Уровень + 1);

	КонецЦикла;
	
КонецФункции
